name:"Housing"
layer {
  type: "MemoryData"
  top: "data"
  top: "label"
  memory_data_param {
    batch_size: 506
    channels: 1
    height: 1
    width: 13
  }
}
layer {
  name: "ip"
  type: "InnerProduct"
  bottom: "data"
  top: "ip"
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "ip"
  bottom: "label"
  top: "loss"
}
